Config/Documents/УвольнениеСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>УвольнениеСотрудника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КадровыеПеремещения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/КадровыеПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КадровыеПеремещения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КадровыеДействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/КадровыеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>КадровыеДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Найм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/УвольнениеСотрудника/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// проверка корректности даты  и прав
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) И Не РольДоступна("Администратор") Тогда
		Сообщить("Документы должны проводиться текущией датой! Для проведения обратитесь к администратору.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// регистр КадровыеПеремещения
	Движения.КадровыеПеремещения.Записывать = Истина;
	Движение = Движения.КадровыеПеремещения.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Действие = Перечисления.КадровыеДействия.Увольнение;

	Попытка
		// Обновление информации сотрудника в справочнике Сотрудники
		ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
		ОбъектСотрудник.Уволен = Истина;
		ОбъектСотрудник.Записать();
	Исключение
		Сообщить("Ошибка при обновлении сотрудника! Обновите информацию вручную.");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// проверка даты и прав
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДата()) И Не РольДоступна("Администратор") Тогда
		Сообщить("Запрещено снимать проведение документов за прошедший период! Обратитесь к администратору.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	Попытка
		// Обновление информации сотрудника в справочнике Сотрудники
		ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
		ОбъектСотрудник.Уволен = Ложь;
		ОбъектСотрудник.Записать();
	Исключение
		Сообщить("Ошибка при обновлении сотрудника! Обновите информацию вручную.");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры
